/* automatically generated by rust-bindgen 0.55.1 */

pub const __llvm__: u32 = 1;
pub const __clang__: u32 = 1;
pub const __clang_major__: u32 = 9;
pub const __clang_minor__: u32 = 0;
pub const __clang_patchlevel__: u32 = 0;
pub const __clang_version__: &'static [u8; 26usize] = b"9.0.0 (CLANG: Build#1030)\0";
pub const __GNUC_MINOR__: u32 = 2;
pub const __GNUC_PATCHLEVEL__: u32 = 1;
pub const __GNUC__: u32 = 4;
pub const __GXX_ABI_VERSION: u32 = 1002;
pub const __ATOMIC_RELAXED: u32 = 0;
pub const __ATOMIC_CONSUME: u32 = 1;
pub const __ATOMIC_ACQUIRE: u32 = 2;
pub const __ATOMIC_RELEASE: u32 = 3;
pub const __ATOMIC_ACQ_REL: u32 = 4;
pub const __ATOMIC_SEQ_CST: u32 = 5;
pub const __OPENCL_MEMORY_SCOPE_WORK_ITEM: u32 = 0;
pub const __OPENCL_MEMORY_SCOPE_WORK_GROUP: u32 = 1;
pub const __OPENCL_MEMORY_SCOPE_DEVICE: u32 = 2;
pub const __OPENCL_MEMORY_SCOPE_ALL_SVM_DEVICES: u32 = 3;
pub const __OPENCL_MEMORY_SCOPE_SUB_GROUP: u32 = 4;
pub const __PRAGMA_REDEFINE_EXTNAME: u32 = 1;
pub const __VERSION__: &'static [u8; 65usize] =
    b"AOCC.LLVM.2.1.0.B1030.2019_11_12 Clang 9.0.0 (CLANG: Build#1030)\0";
pub const __OBJC_BOOL_IS_BOOL: u32 = 0;
pub const __CONSTANT_CFSTRINGS__: u32 = 1;
pub const __ORDER_LITTLE_ENDIAN__: u32 = 1234;
pub const __ORDER_BIG_ENDIAN__: u32 = 4321;
pub const __ORDER_PDP_ENDIAN__: u32 = 3412;
pub const __BYTE_ORDER__: u32 = 1234;
pub const __LITTLE_ENDIAN__: u32 = 1;
pub const _LP64: u32 = 1;
pub const __LP64__: u32 = 1;
pub const __CHAR_BIT__: u32 = 8;

pub const MPI_T_ERR_PVAR_NO_ATOMIC: u32 = 72;
pub const MPI_T_ERR_INVALID_NAME: u32 = 73;
pub const MPI_T_ERR_INVALID: u32 = 74;
pub const MPI_ERR_LASTCODE: u32 = 1073741823;
pub const MPICH_ERR_LAST_CLASS: u32 = 74;
pub const MPICH_ERR_FIRST_MPIX: u32 = 100;
pub const MPIX_ERR_PROC_FAILED: u32 = 101;
pub const MPIX_ERR_PROC_FAILED_PENDING: u32 = 102;
pub const MPIX_ERR_REVOKED: u32 = 103;
pub const MPIX_ERR_EAGAIN: u32 = 104;
pub const MPIX_ERR_NOREQ: u32 = 105;
pub const MPICH_ERR_LAST_MPIX: u32 = 105;
pub const MPIIMPL_ADVERTISES_FEATURES: u32 = 1;
pub const MPIIMPL_HAVE_MPI_INFO: u32 = 1;
pub const MPIIMPL_HAVE_MPI_COMBINER_DARRAY: u32 = 1;
pub const MPIIMPL_HAVE_MPI_TYPE_CREATE_DARRAY: u32 = 1;
pub const MPIIMPL_HAVE_MPI_COMBINER_SUBARRAY: u32 = 1;
pub const MPIIMPL_HAVE_MPI_COMBINER_DUP: u32 = 1;
pub const MPIIMPL_HAVE_MPI_GREQUEST: u32 = 1;
pub const MPIIMPL_HAVE_STATUS_SET_BYTES: u32 = 1;
pub const MPIIMPL_HAVE_STATUS_SET_INFO: u32 = 1;
pub const ROMIO_VERSION: u32 = 126;
pub const HAVE_MPI_GREQUEST: u32 = 1;
pub const MPI_MODE_RDONLY: u32 = 2;
pub const MPI_MODE_RDWR: u32 = 8;
pub const MPI_MODE_WRONLY: u32 = 4;
pub const MPI_MODE_CREATE: u32 = 1;
pub const MPI_MODE_EXCL: u32 = 64;
pub const MPI_MODE_DELETE_ON_CLOSE: u32 = 16;
pub const MPI_MODE_UNIQUE_OPEN: u32 = 32;
pub const MPI_MODE_APPEND: u32 = 128;
pub const MPI_MODE_SEQUENTIAL: u32 = 256;
pub const MPI_DISPLACEMENT_CURRENT: i32 = -54278278;
pub const MPI_SEEK_SET: u32 = 600;
pub const MPI_SEEK_CUR: u32 = 602;
pub const MPI_SEEK_END: u32 = 604;
pub const MPI_MAX_DATAREP_STRING: u32 = 128;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type MPI_Datatype = ::std::os::raw::c_int;
pub type MPI_Comm = ::std::os::raw::c_int;
pub type MPI_Group = ::std::os::raw::c_int;
pub type MPI_Win = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADIOI_FileD {
    _unused: [u8; 0],
}
pub type MPI_File = *mut ADIOI_FileD;
pub type MPI_Op = ::std::os::raw::c_int;
pub const MPIR_Win_flavor_MPI_WIN_FLAVOR_CREATE: MPIR_Win_flavor = 1;
pub const MPIR_Win_flavor_MPI_WIN_FLAVOR_ALLOCATE: MPIR_Win_flavor = 2;
pub const MPIR_Win_flavor_MPI_WIN_FLAVOR_DYNAMIC: MPIR_Win_flavor = 3;
pub const MPIR_Win_flavor_MPI_WIN_FLAVOR_SHARED: MPIR_Win_flavor = 4;
pub type MPIR_Win_flavor = ::std::os::raw::c_uint;
pub use self::MPIR_Win_flavor as MPIR_Win_flavor_t;
pub const MPIR_Win_model_MPI_WIN_SEPARATE: MPIR_Win_model = 1;
pub const MPIR_Win_model_MPI_WIN_UNIFIED: MPIR_Win_model = 2;
pub type MPIR_Win_model = ::std::os::raw::c_uint;
pub use self::MPIR_Win_model as MPIR_Win_model_t;
pub const MPIR_Topo_type_MPI_GRAPH: MPIR_Topo_type = 1;
pub const MPIR_Topo_type_MPI_CART: MPIR_Topo_type = 2;
pub const MPIR_Topo_type_MPI_DIST_GRAPH: MPIR_Topo_type = 3;
pub type MPIR_Topo_type = ::std::os::raw::c_uint;
extern "C" {
    pub static MPI_UNWEIGHTED: *mut ::std::os::raw::c_int;
}
extern "C" {
    pub static MPI_WEIGHTS_EMPTY: *mut ::std::os::raw::c_int;
}
pub type MPI_Handler_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut MPI_Comm, arg2: *mut ::std::os::raw::c_int, ...),
>;
pub type MPI_Comm_copy_attr_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Comm,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
        arg5: *mut ::std::os::raw::c_void,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Comm_delete_attr_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Comm,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Type_copy_attr_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Datatype,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
        arg5: *mut ::std::os::raw::c_void,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Type_delete_attr_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Datatype,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Win_copy_attr_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Win,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
        arg5: *mut ::std::os::raw::c_void,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Win_delete_attr_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Win,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Comm_errhandler_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut MPI_Comm, arg2: *mut ::std::os::raw::c_int, ...),
>;
pub type MPI_File_errhandler_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut MPI_File, arg2: *mut ::std::os::raw::c_int, ...),
>;
pub type MPI_Win_errhandler_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut MPI_Win, arg2: *mut ::std::os::raw::c_int, ...),
>;
pub type MPI_Comm_errhandler_fn = MPI_Comm_errhandler_function;
pub type MPI_File_errhandler_fn = MPI_File_errhandler_function;
pub type MPI_Win_errhandler_fn = MPI_Win_errhandler_function;
pub type MPI_Errhandler = ::std::os::raw::c_int;
pub type MPI_Request = ::std::os::raw::c_int;
pub type MPI_Message = ::std::os::raw::c_int;
pub type MPI_User_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut MPI_Datatype,
    ),
>;
pub type MPI_Copy_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Comm,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
        arg5: *mut ::std::os::raw::c_void,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Delete_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Comm,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub const MPIR_Combiner_enum_MPI_COMBINER_NAMED: MPIR_Combiner_enum = 1;
pub const MPIR_Combiner_enum_MPI_COMBINER_DUP: MPIR_Combiner_enum = 2;
pub const MPIR_Combiner_enum_MPI_COMBINER_CONTIGUOUS: MPIR_Combiner_enum = 3;
pub const MPIR_Combiner_enum_MPI_COMBINER_VECTOR: MPIR_Combiner_enum = 4;
pub const MPIR_Combiner_enum_MPI_COMBINER_HVECTOR_INTEGER: MPIR_Combiner_enum = 5;
pub const MPIR_Combiner_enum_MPI_COMBINER_HVECTOR: MPIR_Combiner_enum = 6;
pub const MPIR_Combiner_enum_MPI_COMBINER_INDEXED: MPIR_Combiner_enum = 7;
pub const MPIR_Combiner_enum_MPI_COMBINER_HINDEXED_INTEGER: MPIR_Combiner_enum = 8;
pub const MPIR_Combiner_enum_MPI_COMBINER_HINDEXED: MPIR_Combiner_enum = 9;
pub const MPIR_Combiner_enum_MPI_COMBINER_INDEXED_BLOCK: MPIR_Combiner_enum = 10;
pub const MPIR_Combiner_enum_MPI_COMBINER_STRUCT_INTEGER: MPIR_Combiner_enum = 11;
pub const MPIR_Combiner_enum_MPI_COMBINER_STRUCT: MPIR_Combiner_enum = 12;
pub const MPIR_Combiner_enum_MPI_COMBINER_SUBARRAY: MPIR_Combiner_enum = 13;
pub const MPIR_Combiner_enum_MPI_COMBINER_DARRAY: MPIR_Combiner_enum = 14;
pub const MPIR_Combiner_enum_MPI_COMBINER_F90_REAL: MPIR_Combiner_enum = 15;
pub const MPIR_Combiner_enum_MPI_COMBINER_F90_COMPLEX: MPIR_Combiner_enum = 16;
pub const MPIR_Combiner_enum_MPI_COMBINER_F90_INTEGER: MPIR_Combiner_enum = 17;
pub const MPIR_Combiner_enum_MPI_COMBINER_RESIZED: MPIR_Combiner_enum = 18;
pub const MPIR_Combiner_enum_MPI_COMBINER_HINDEXED_BLOCK: MPIR_Combiner_enum = 19;
pub type MPIR_Combiner_enum = ::std::os::raw::c_uint;
pub type MPI_Info = ::std::os::raw::c_int;
pub type MPI_Aint = ::std::os::raw::c_long;
pub type MPI_Fint = ::std::os::raw::c_int;
pub type MPI_Count = ::std::os::raw::c_longlong;
pub type MPI_Offset = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPI_Status {
    pub count_lo: ::std::os::raw::c_int,
    pub count_hi_and_cancelled: ::std::os::raw::c_int,
    pub MPI_SOURCE: ::std::os::raw::c_int,
    pub MPI_TAG: ::std::os::raw::c_int,
    pub MPI_ERROR: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MPI_Status() {
    assert_eq!(
        ::std::mem::size_of::<MPI_Status>(),
        20usize,
        concat!("Size of: ", stringify!(MPI_Status))
    );
    assert_eq!(
        ::std::mem::align_of::<MPI_Status>(),
        4usize,
        concat!("Alignment of ", stringify!(MPI_Status))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_Status>())).count_lo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_Status),
            "::",
            stringify!(count_lo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MPI_Status>())).count_hi_and_cancelled as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_Status),
            "::",
            stringify!(count_hi_and_cancelled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_Status>())).MPI_SOURCE as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_Status),
            "::",
            stringify!(MPI_SOURCE)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_Status>())).MPI_TAG as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_Status),
            "::",
            stringify!(MPI_TAG)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_Status>())).MPI_ERROR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_Status),
            "::",
            stringify!(MPI_ERROR)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPIR_T_enum_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPIR_T_cvar_handle_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPIR_T_pvar_handle_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPIR_T_pvar_session_s {
    _unused: [u8; 0],
}
pub type MPI_T_enum = *mut MPIR_T_enum_s;
pub type MPI_T_cvar_handle = *mut MPIR_T_cvar_handle_s;
pub type MPI_T_pvar_handle = *mut MPIR_T_pvar_handle_s;
pub type MPI_T_pvar_session = *mut MPIR_T_pvar_session_s;
extern "C" {
    pub static MPI_T_PVAR_ALL_HANDLES: *mut MPIR_T_pvar_handle_s;
}
pub const MPIR_T_verbosity_t_MPIX_T_VERBOSITY_INVALID: MPIR_T_verbosity_t = 0;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_USER_BASIC: MPIR_T_verbosity_t = 221;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_USER_DETAIL: MPIR_T_verbosity_t = 222;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_USER_ALL: MPIR_T_verbosity_t = 223;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_TUNER_BASIC: MPIR_T_verbosity_t = 224;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_TUNER_DETAIL: MPIR_T_verbosity_t = 225;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_TUNER_ALL: MPIR_T_verbosity_t = 226;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_MPIDEV_BASIC: MPIR_T_verbosity_t = 227;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_MPIDEV_DETAIL: MPIR_T_verbosity_t = 228;
pub const MPIR_T_verbosity_t_MPI_T_VERBOSITY_MPIDEV_ALL: MPIR_T_verbosity_t = 229;
pub type MPIR_T_verbosity_t = ::std::os::raw::c_uint;
pub const MPIR_T_bind_t_MPIX_T_BIND_INVALID: MPIR_T_bind_t = 0;
pub const MPIR_T_bind_t_MPI_T_BIND_NO_OBJECT: MPIR_T_bind_t = 9700;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_COMM: MPIR_T_bind_t = 9701;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_DATATYPE: MPIR_T_bind_t = 9702;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_ERRHANDLER: MPIR_T_bind_t = 9703;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_FILE: MPIR_T_bind_t = 9704;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_GROUP: MPIR_T_bind_t = 9705;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_OP: MPIR_T_bind_t = 9706;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_REQUEST: MPIR_T_bind_t = 9707;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_WIN: MPIR_T_bind_t = 9708;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_MESSAGE: MPIR_T_bind_t = 9709;
pub const MPIR_T_bind_t_MPI_T_BIND_MPI_INFO: MPIR_T_bind_t = 9710;
pub type MPIR_T_bind_t = ::std::os::raw::c_uint;
pub const MPIR_T_scope_t_MPIX_T_SCOPE_INVALID: MPIR_T_scope_t = 0;
pub const MPIR_T_scope_t_MPI_T_SCOPE_CONSTANT: MPIR_T_scope_t = 60438;
pub const MPIR_T_scope_t_MPI_T_SCOPE_READONLY: MPIR_T_scope_t = 60439;
pub const MPIR_T_scope_t_MPI_T_SCOPE_LOCAL: MPIR_T_scope_t = 60440;
pub const MPIR_T_scope_t_MPI_T_SCOPE_GROUP: MPIR_T_scope_t = 60441;
pub const MPIR_T_scope_t_MPI_T_SCOPE_GROUP_EQ: MPIR_T_scope_t = 60442;
pub const MPIR_T_scope_t_MPI_T_SCOPE_ALL: MPIR_T_scope_t = 60443;
pub const MPIR_T_scope_t_MPI_T_SCOPE_ALL_EQ: MPIR_T_scope_t = 60444;
pub type MPIR_T_scope_t = ::std::os::raw::c_uint;
pub const MPIR_T_pvar_class_t_MPIX_T_PVAR_CLASS_INVALID: MPIR_T_pvar_class_t = 0;
pub const MPIR_T_pvar_class_t_MPIR_T_PVAR_CLASS_FIRST: MPIR_T_pvar_class_t = 240;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_STATE: MPIR_T_pvar_class_t = 240;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_LEVEL: MPIR_T_pvar_class_t = 241;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_SIZE: MPIR_T_pvar_class_t = 242;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_PERCENTAGE: MPIR_T_pvar_class_t = 243;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_HIGHWATERMARK: MPIR_T_pvar_class_t = 244;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_LOWWATERMARK: MPIR_T_pvar_class_t = 245;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_COUNTER: MPIR_T_pvar_class_t = 246;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_AGGREGATE: MPIR_T_pvar_class_t = 247;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_TIMER: MPIR_T_pvar_class_t = 248;
pub const MPIR_T_pvar_class_t_MPI_T_PVAR_CLASS_GENERIC: MPIR_T_pvar_class_t = 249;
pub const MPIR_T_pvar_class_t_MPIR_T_PVAR_CLASS_LAST: MPIR_T_pvar_class_t = 250;
pub const MPIR_T_pvar_class_t_MPIR_T_PVAR_CLASS_NUMBER: MPIR_T_pvar_class_t = 10;
pub type MPIR_T_pvar_class_t = ::std::os::raw::c_uint;
extern "C" {
    pub static mut MPI_F_STATUS_IGNORE: *mut MPI_Fint;
}
extern "C" {
    pub static mut MPI_F_STATUSES_IGNORE: *mut MPI_Fint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPI_F08_status {
    pub count_lo: MPI_Fint,
    pub count_hi_and_cancelled: MPI_Fint,
    pub MPI_SOURCE: MPI_Fint,
    pub MPI_TAG: MPI_Fint,
    pub MPI_ERROR: MPI_Fint,
}
#[test]
fn bindgen_test_layout_MPI_F08_status() {
    assert_eq!(
        ::std::mem::size_of::<MPI_F08_status>(),
        20usize,
        concat!("Size of: ", stringify!(MPI_F08_status))
    );
    assert_eq!(
        ::std::mem::align_of::<MPI_F08_status>(),
        4usize,
        concat!("Alignment of ", stringify!(MPI_F08_status))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_F08_status>())).count_lo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_F08_status),
            "::",
            stringify!(count_lo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MPI_F08_status>())).count_hi_and_cancelled as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_F08_status),
            "::",
            stringify!(count_hi_and_cancelled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_F08_status>())).MPI_SOURCE as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_F08_status),
            "::",
            stringify!(MPI_SOURCE)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_F08_status>())).MPI_TAG as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_F08_status),
            "::",
            stringify!(MPI_TAG)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MPI_F08_status>())).MPI_ERROR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPI_F08_status),
            "::",
            stringify!(MPI_ERROR)
        )
    );
}
extern "C" {
    pub static mut MPIR_F08_MPI_STATUS_IGNORE_OBJ: MPI_F08_status;
}
extern "C" {
    pub static mut MPIR_F08_MPI_STATUSES_IGNORE_OBJ: [MPI_F08_status; 1usize];
}
extern "C" {
    pub static mut MPIR_F08_MPI_IN_PLACE: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut MPIR_F08_MPI_BOTTOM: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut MPI_F08_STATUS_IGNORE: *mut MPI_F08_status;
}
extern "C" {
    pub static mut MPI_F08_STATUSES_IGNORE: *mut MPI_F08_status;
}
pub type MPI_Grequest_cancel_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Grequest_free_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
